In [5]:
import pandas as pd

area = pd.Series({'CN': 9.6, 'RU': 17, 'US': 9.8})
population = pd.Series({'CN': 1386, 'RU': 144, 'US': 327})

countries = pd.DataFrame(
    {"area": area, "population": population}
)
countries

    area  population
CN   9.6        1386
RU  17.0         144
US   9.8         327

In [6]:
euribor = pd.read_csv(
    "https://datahub.io/core/euribor/r/euribor-12m-monthly.csv"
)

In [10]:
euribor = pd.read_csv(
    "https://datahub.io/core/euribor/r/euribor-12m-monthly.csv",
    parse_dates=["date"],
    index_col="date",
    usecols=["date", "rate"]
)

In [15]:
sp500 = pd.read_csv(
    "https://datahub.io/core/s-and-p-500/r/data.csv",
    index_col="Date",
    parse_dates=["Date"]
)

In [18]:
er = pd.read_csv(
    "https://datahub.io/core/us-euro-foreign-exchange-rate/r/monthly.csv",
    parse_dates=["Date"]
)

In [26]:
iris = pd.read_csv(
    "https://raw.githubusercontent.com/mwaskom/seaborn-data/master/iris.csv"
)

In [24]:
titanic = pd.read_csv(
    "https://public.opendatasoft.com/explore/dataset/titanic-passengers/download",
    sep=";",
    index_col="passengerid"
)

In [27]:
titanic.describe()

           pclass         age       sibsp       parch        fare
count  891.000000  714.000000  891.000000  891.000000  891.000000
mean     2.308642   29.699118    0.523008    0.381594   32.204208
std      0.836071   14.526497    1.102743    0.806057   49.693429
min      1.000000    0.420000    0.000000    0.000000    0.000000
25%      2.000000   20.125000    0.000000    0.000000    7.910400
50%      3.000000   28.000000    0.000000    0.000000   14.454200
75%      3.000000   38.000000    1.000000    0.000000   31.000000
max      3.000000   80.000000    8.000000    6.000000  512.329200

In [28]:
titanic["age"].median()

28.0

In [30]:
titanic.columns

Index(['survived', 'pclass', 'name', 'sex', 'age', 'sibsp', 'parch', 'ticket',
       'fare', 'cabin', 'embarked'],
      dtype='object')

In [34]:
titanic.name

passengerid
431    Bjornstrom-Steffansson, Mr. Mauritz Hakan
664                             Coleff, Mr. Peju
44      Laroche, Miss. Simonne Marie Anne Andree
347                    Smith, Miss. Marion Elsie
891                          Dooley, Mr. Patrick
                         ...
743        Ryerson, Miss. Susan Parker "Suzette"
766         Hogeboom, Mrs. John C (Anna Andrews)
356                  Vanden Steen, Mr. Leo Peter
449               Baclini, Miss. Marie Catherine
546                 Nicholson, Mr. Arthur Ernest
Name: name, Length: 891, dtype: object

In [35]:
titanic["name"]

passengerid
431    Bjornstrom-Steffansson, Mr. Mauritz Hakan
664                             Coleff, Mr. Peju
44      Laroche, Miss. Simonne Marie Anne Andree
347                    Smith, Miss. Marion Elsie
891                          Dooley, Mr. Patrick
                         ...
743        Ryerson, Miss. Susan Parker "Suzette"
766         Hogeboom, Mrs. John C (Anna Andrews)
356                  Vanden Steen, Mr. Leo Peter
449               Baclini, Miss. Marie Catherine
546                 Nicholson, Mr. Arthur Ernest
Name: name, Length: 891, dtype: object

In [37]:
sp500.loc["1871-05-01"]

SP500                    4.86
Dividend                 0.26
Earnings                 0.40
Consumer Price Index    12.27
Long Interest Rate       5.33
Real Price              98.93
Real Dividend            5.29
Real Earnings            8.14
PE10                      NaN
Name: 1871-05-01 00:00:00, dtype: float64

In [38]:
sp500.loc["1872-01-01" : "1872-12-31"]

,SP500,Dividend,Earnings,Consumer Price Index,Long Interest Rate,Real Price,Real Dividend,Real Earnings,PE10
Date,,,,,,,,,
1872-01-01,4.86,0.26,0.40,12.65,5.36,95.95,5.20,7.95,NaN
1872-02-01,4.88,0.27,0.41,12.65,5.38,96.35,5.27,8.00,NaN
1872-03-01,5.04,0.27,0.41,12.84,5.40,98.03,5.25,7.93,NaN
1872-04-01,5.18,0.27,0.41,13.13,5.42,98.56,5.20,7.80,NaN
1872-05-01,5.18,0.28,0.41,13.13,5.43,98.56,5.26,7.85,NaN
1872-06-01,5.13,0.28,0.41,13.03,5.45,98.32,5.37,7.95,NaN
1872-07-01,5.10,0.28,0.42,12.84,5.47,99.20,5.51,8.12,NaN
1872-08-01,5.04,0.29,0.42,12.94,5.49,97.31,5.54,8.11,NaN
1872-09-01,4.95,0.29,0.42,13.03,5.51,94.87,5.56,8.10,NaN
1872-10-01,4.97,0.29,0.42,12.75,5.52,97.39,5.75,8.33,NaN
1872-11-01,4.95,0.30,0.43,13.13,5.54,94.19,5.65,8.13,NaN
1872-12-01,5.07,0.30,0.43,12.94,5.56,97.89,5.79,8.30,NaN

In [39]:
sp500.iloc[0:10]

,SP500,Dividend,Earnings,Consumer Price Index,Long Interest Rate,Real Price,Real Dividend,Real Earnings,PE10
Date,,,,,,,,,
1871-01-01,4.44,0.26,0.4,12.46,5.32,89.00,5.21,8.02,NaN
1871-02-01,4.50,0.26,0.4,12.84,5.32,87.53,5.06,7.78,NaN
1871-03-01,4.61,0.26,0.4,13.03,5.33,88.36,4.98,7.67,NaN
1871-04-01,4.74,0.26,0.4,12.56,5.33,94.29,5.17,7.96,NaN
1871-05-01,4.86,0.26,0.4,12.27,5.33,98.93,5.29,8.14,NaN
1871-06-01,4.82,0.26,0.4,12.08,5.34,99.66,5.38,8.27,NaN
1871-07-01,4.73,0.26,0.4,12.08,5.34,97.80,5.38,8.27,NaN
1871-08-01,4.79,0.26,0.4,11.89,5.34,100.62,5.46,8.40,NaN
1871-09-01,4.84,0.26,0.4,12.18,5.35,99.29,5.33,8.21,NaN
1871-10-01,4.59,0.26,0.4,12.37,5.35,92.71,5.25,8.08,NaN

In [41]:
titanic[titanic.pclass != 1]
titanic[titanic["pclass"] != 1]

,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
passengerid,,,,,,,,,,,
664,No,3,"Coleff, Mr. Peju",male,36.00,0,0,349210,7.4958,NaN,S
44,Yes,2,"Laroche, Miss. Simonne Marie Anne Andree",female,3.00,1,2,SC/Paris 2123,41.5792,NaN,C
347,Yes,2,"Smith, Miss. Marion Elsie",female,40.00,0,0,31418,13.0000,NaN,S
891,No,3,"Dooley, Mr. Patrick",male,32.00,0,0,370376,7.7500,NaN,Q
100,No,2,"Kantor, Mr. Sinai",male,34.00,1,0,244367,26.0000,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
203,No,3,"Johanson, Mr. Jakob Alfred",male,34.00,0,0,3101264,6.4958,NaN,S
348,Yes,3,"Davison, Mrs. Thomas Henry (Mary E Finck)",female,NaN,1,0,386525,16.1000,NaN,S
645,Yes,3,"Baclini, Miss. Eugenie",female,0.75,2,1,2666,19.2583,NaN,C
356,No,3,"Vanden Steen, Mr. Leo Peter",male,28.00,0,0,345783,9.5000,NaN,S
449,Yes,3,"Baclini, Miss. Marie Catherine",female,5.00,2,1,2666,19.2583,NaN,C

In [44]:
titanic.sample(5)

,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
passengerid,,,,,,,,,,,
552,No,2,"Sharp, Mr. Percival James R",male,27.0,0,0,244358,26.0000,NaN,S
464,No,2,"Milling, Mr. Jacob Christian",male,48.0,0,0,234360,13.0000,NaN,S
582,Yes,1,"Thayer, Mrs. John Borland (Marian Longstreth M...",female,39.0,1,1,17421,110.8833,C68,C
712,No,1,"Klaber, Mr. Herman",male,NaN,0,0,113028,26.5500,C124,S
623,Yes,3,"Nakid, Mr. Sahid",male,20.0,1,1,2653,15.7417,NaN,C

In [45]:
for x in titanic:
    print(x)

survived
pclass
name
sex
age
sibsp
parch
ticket
fare
cabin
embarked

In [47]:
er["Country"].unique()

array(['Australia', 'Austria', 'Belgium', 'Brazil', 'Canada', 'China',
       'Denmark', 'Euro', 'Finland', 'France', 'Germany', 'Greece',
       'Hong Kong', 'India', 'Ireland', 'Italy', 'Japan', 'Malaysia',
       'Mexico', 'Netherlands', 'New Zealand', 'Norway', 'Portugal',
       'Singapore', 'South Africa', 'South Korea', 'Spain', 'Sri Lanka',
       'Sweden', 'Switzerland', 'Taiwan', 'Thailand', 'United Kingdom',
       'Venezuela'], dtype=object)

In [48]:
a = [0, 1, 2, 3, 4]

In [49]:
a[0:]

[0, 1, 2, 3]

In [50]:
import tables